UI-ScenarioTestManager/src/ExternalDataProcessors/МенеджерСценарногоТеста/МенеджерСценарногоТеста.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ExternalDataProcessor>
  <name>МенеджерСценарногоТеста</name>
  <comment>автор ivanov660 (Владимир Крючков)</comment>
  <attributes>
    <name>Severity</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АвтозагрузкаДереваПроектов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АвтозагрузкаПоследнегоСценария</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресИнтернет</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Версия</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяВыполнения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяВыполненияUTC</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГенерироватьКодПодключенияКлиента</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГенерироватьПолучениеРодительскихОбъектовВИерархии</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныеОпцииЗапуска</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторТеста</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Наименование</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НеПроизводитьОтключениеЕслиДальшеПодключаетсяТудаЖе</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПорта</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерПроверки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пароль1С</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоискОбъектов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь1С</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутьККаталогуБиблиотекиСценариев</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутьККаталогуОтчетовВыполненияТестов</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутьККаталогуНаборовСценариев</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутьКИсполняемомуФайлу1С</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутьКФайлуСценария</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутьПодключенияКлиентаТестирования</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимАвтотест</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимРедактированияСценария</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СообщенияОбОшибкахПреобразования</name>
    <type>
      <types>ValueList</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипФайлаСценария</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФайловаяБаза</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФорматФайлаОтчета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяЛога</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутьКИсполняемомуФайлуGIT</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутьККаталогуGIT</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьСохранениеДерева</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуемыйAPI</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПутьКФайлуExternAutomationUI</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПортаExternAutomationUI</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресИнтернетExternAutomationUI</name>
    <comment>По умолчанию localhost</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Браузер</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсключатьКомандуFocus</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимScreenShot</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоНеПредприятие1С</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>DataDrivenTest</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутьКФайлуДанных</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>TestID</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсключатьПоискФорм</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Исключать_xPath</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭкспериментальныйФункционал</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутьИсполняемыйФайлБраузера</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:ExternalDataProcessor>

UI-ScenarioTestManager/src/ExternalDataProcessors/МенеджерСценарногоТеста/Forms/Модуль_ФункцияПамять/Module.bsl
&НаКлиенте
Перем Модуль_СервисныеФункции;

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Отказ = Истина; // форма не предназначена для открытия
КонецПроцедуры


&НаКлиенте
Процедура мСценСкрипт_ОбработатьОперациюРаботыПамяти(ОписаниеОшибки,мПараметрыКлиент,мПараметры) Экспорт
	
	ИмяКоманды = нрег(мПараметры.ИмяКоманды);
	ИмяПараметра = мПараметры.ИмяПараметра;
	mKey = мПараметры.Key;
	Type = мПараметры.Type;
	ПараметрыПодключенияПоУмолчанию = мПараметры.ПараметрыПодключенияПоУмолчанию;
	FileName = мПараметры.FileName;
	СтруктураДанных = Неопределено;
	ПараметрыСценария = мПараметры.ПараметрыСценария;
	
	ПутьКФайлу = "";
	Если Type="TemporaryJSON" Тогда
		Файл = новый Файл(ПолучитьИмяВременногоФайла(".txt"));
		ПутьКФайлу = Файл.Путь + FileName + ?(Найти(ПутьКФайлу,"."),"",".txt");
	ИначеЕсли Type="CatalogJSON" Тогда
		ПутьКФайлу = FileName + ?(Найти(ПутьКФайлу,"."),"",".txt");;
	КонецЕсли;
	
	Если ИмяКоманды="запомнить" Тогда
		
		СтруктураДанных = новый Структура;
		МассивДанных = СтрРазделить(ИмяПараметра,",;:/\",Ложь);
		Для каждого ИмяСтрокой из МассивДанных Цикл
			Для каждого стр из ПараметрыСценария Цикл
				Если нрег(ИмяСтрокой)=нрег(стр.Имя) Тогда
					СтруктураДанных.Вставить(ИмяСтрокой,стр.Значение);
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		
		Если Type="TemporaryJSON" ИЛИ Type="CatalogJSON" Тогда
			ЗаписатьПараметрыВФайлJSON(ПутьКФайлу,СтруктураДанных);	
		ИначеЕсли Type="1CBase" Тогда
			ЗаписатьПараметрыВБазу(ПутьКФайлу,СтруктураДанных);
		ИначеЕсли Type="1CConnectionProperty" Тогда
			ВызватьИсключение "Нельзя изменять параметры подключения из сценария!";
		КонецЕсли;
	ИначеЕсли ИмяКоманды="вспомнить" Тогда
		Если Type="TemporaryJSON" ИЛИ Type="CatalogJSON" Тогда
			СтруктураДанных = ПрочитатьПараметрыИзФайлаJSON(ПутьКФайлу,ИмяПараметра);
		ИначеЕсли Type="1CBase" Тогда
			СтруктураДанных = ПрочитатьПараметрыИзБазы(ПутьКФайлу,ИмяПараметра);
		ИначеЕсли Type="1CConnectionProperty" Тогда
			СтруктураДанных = ПрочитатьПараметрыПодключения(mKey,ИмяПараметра,ПараметрыПодключенияПоУмолчанию);			
		КонецЕсли;
		
		//сохраним в параметрах
		Если НЕ СтруктураДанных=Неопределено Тогда
			Для каждого  элемент из СтруктураДанных Цикл
				Для каждого стр из ПараметрыСценария Цикл
					Если нрег(элемент.Ключ)=нрег(стр.Имя) Тогда
						стр.Значение = Элемент.Значение;
					КонецЕсли;
				КонецЦикла;
			КонецЦикла;
		КонецЕсли;
		
	ИначеЕсли ИмяКоманды="забыть" Тогда
		Если Type="TemporaryJSON" ИЛИ Type="CatalogJSON" Тогда
		ИначеЕсли Type="1CBase" Тогда
			УдалитьПараметрыИзБазы(ПутьКФайлу,ИмяПараметра);
		ИначеЕсли Type="1CConnectionProperty" Тогда
			ВызватьИсключение "Нельзя изменять параметры подключения из сценария!";
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры


#Область СохранениеЗагрузкаФайл

&НаКлиенте
Функция ПрочитатьПараметрыИзФайлаJSON(Знач ПутьКФайлу, Знач ПараметрыСтрокой) Экспорт
	
	ЗагрузитьБиблиотеки();
	
	СоответствиеДанных = новый Соответствие;
	МассивПараметров = СтрРазделить(ПараметрыСтрокой,",;:/\",Ложь);
	Если МассивПараметров.Количество()=0 Тогда
		ВызватьИсключение "Имя параметров пустое или некорректное!";
	КонецЕсли;
	
	ТекстДок = новый ТекстовыйДокумент;
	ТекстДок.Прочитать(ПутьКФайлу,КодировкаТекста.UTF8);
	ДанныеСтрокой = ТекстДок.ПолучитьТекст();
	ТекстДок  =Неопределено;
	
	СтруктураДанных = Модуль_СервисныеФункции.ОбработкаJSON(ДанныеСтрокой);
	
	Возврат СтруктураДанных;
	
КонецФункции

&НаКлиенте
Процедура ЗаписатьПараметрыВФайлJSON(Знач ПутьКФайлу, Знач СтруктураДанных) Экспорт
	
	ЗагрузитьБиблиотеки();
	
	// 1. Загрузим что в файле
	МассивСтрок = новый Массив;
	Для каждого стр из СтруктураДанных Цикл
		МассивСтрок.Добавить(стр.Ключ);
	КонецЦикла;
	ПараметрыСтрокой = СтрСоединить(МассивСтрок,",");
	
	Файл = новый Файл(ПутьКФайлу);
	Если Файл.Существует() Тогда
		ПолнаяСтруктураДанных = ПрочитатьПараметрыИзФайлаJSON(ПутьКФайлу,ПараметрыСтрокой);
	
		// 2. Дополним значениями
		Для каждого стр из СтруктураДанных Цикл
			ПолнаяСтруктураДанных.Вставить(стр.Ключ,стр.Значение);
		КонецЦикла;
	Иначе
		ПолнаяСтруктураДанных = СтруктураДанных;
	КонецЕсли;
	
	// 3. Сохраним
	Строка = Модуль_СервисныеФункции.ДанныеВJSONСтроку(ПолнаяСтруктураДанных);
	ТекстДок = новый ТекстовыйДокумент;
	ТекстДок.УстановитьТекст(Строка);
	ТекстДок.Записать(ПутьКФайлу,КодировкаТекста.UTF8);
	ТекстДок = Неопределено;	
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьПараметрыИзФайлаJSON(Знач ПутьКФайлу, Знач ПараметрыСтрокой) Экспорт
	
	ЗагрузитьБиблиотеки();
	
	СоответствиеДанных = новый Соответствие;
	МассивПараметров = СтрРазделить(ПараметрыСтрокой,",;:/\",Ложь);
	Если МассивПараметров.Количество()=0 Тогда
		ВызватьИсключение "Имя параметров пустое или некорректное!";
	КонецЕсли;
	
КонецПроцедуры	

#КонецОбласти

#Область СохранениеЗагрузкаПамятьБазы

&НаКлиенте
Функция ПрочитатьПараметрыИзБазы(Знач Ключ, Знач ПараметрыСтрокой) Экспорт
	
	СоответствиеДанных = новый Соответствие;
	МассивПараметров = СтрРазделить(ПараметрыСтрокой,",;:/\",Ложь);
	Если МассивПараметров.Количество()=0 Тогда
		ВызватьИсключение "Имя параметров пустое или некорректное!";
	КонецЕсли;
	
	Для каждого стр из МассивПараметров Цикл
		ИмяПараметра = СокрЛП(стр);		
		ЗначениеПараметра = ПланировщикЗаданийВызовСервера.ПолучитьЗначениеПользовательскойПеременной(Неопределено,ИмяПараметра,Ключ);
		Если ЗначениеПараметра=Неопределено Тогда
			ВызватьИсключение "Значение параметра '"+ИмяПараметра+"' отсутсвует в базе!";
		КонецЕсли;
		СоответствиеДанных.Вставить(ИмяПараметра,ЗначениеПараметра);
	КонецЦикла;	
	
	Возврат СоответствиеДанных;
	
КонецФункции

&НаКлиенте
Процедура ЗаписатьПараметрыВБазу(Знач Ключ, Знач СоответсвиеДанных) Экспорт
	
	Для каждого стр из СоответсвиеДанных Цикл
		
		ИмяПараметра = стр.Ключ;
		ЗначениеПараметра = стр.Значение;
		
		ПланировщикЗаданийВызовСервера.УстановитьЗначениеПользовательскойПеременной(Неопределено,ИмяПараметра,ЗначениеПараметра,Ключ);
		
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьПараметрыИзБазы(Знач Ключ, Знач ПараметрыСтрокой) Экспорт
	
	МассивПараметров = СтрРазделить(ПараметрыСтрокой,",;:/\",Ложь);
	Если МассивПараметров.Количество()=0 Тогда
		ВызватьИсключение "Имя параметров пустое или некорректное!";
	КонецЕсли;
	
	Для каждого стр из МассивПараметров Цикл
		ИмяПараметра = СокрЛП(стр);		
		ПланировщикЗаданийВызовСервера.УдалитьЗначениеПользовательскойПеременной(Неопределено,ИмяПараметра,Ключ);
	КонецЦикла;	
	
КонецПроцедуры


#КонецОбласти

#Область ПараметрыПодключения

Функция ПрочитатьПараметрыПодключения(Знач Ключ, Знач ПараметрыСтрокой, Знач ПараметрыПодключенияПоУмолчанию) Экспорт
	
	СтруктураДанных = Неопределено;
	МассивПараметров = СтрРазделить(ПараметрыСтрокой,",;:/\",Ложь);
	
	Если МассивПараметров.Количество()=0 Тогда
		ВызватьИсключение "Имя параметров пустое или некорректное!";
	КонецЕсли;
	
	Если МассивПараметров.Количество()=0 Тогда
		ВызватьИсключение "Для загрузки параметров подключения допустимо указать только один параметр";
	КонецЕсли;
	
	ИмяПараметра = ПараметрыСтрокой;
	
	СтруктураПодключения = ПланировщикЗаданийВызовСервера.ПолучитьДанныеПодключенияПользователяПоКлючу(Ключ,ИмяПараметра);
	
	Если НЕ СтруктураПодключения=Неопределено Тогда
	
		ОписаниеСвойствПодключения = новый Соответствие;
		
		ОписаниеСвойствПодключения.Вставить("НастройкиПоУмолчанию",Ложь);
		ОписаниеСвойствПодключения.Вставить("СтрокаПодключения",СтруктураПодключения.СтрокаПодключения);
		ОписаниеСвойствПодключения.Вставить("ДополнительныеОпцииЗапуска",СтруктураПодключения.ДополнительныеОпцииЗапуска);
		ОписаниеСвойствПодключения.Вставить("ЭтоФайловаяБаза",СтруктураПодключения.ЭтоФайловаяБаза);
		ОписаниеСвойствПодключения.Вставить("НомерПорта",СтруктураПодключения.НомерПорта);
		ОписаниеСвойствПодключения.Вставить("ЭтоНеПредприятие1С",СтруктураПодключения.ЭтоНеПредприятие1С);
		ОписаниеСвойствПодключения.Вставить("Пароль1С",СтруктураПодключения.Пароль1С);
		ОписаниеСвойствПодключения.Вставить("Пользователь1С",СтруктураПодключения.Пользователь1С);
		ОписаниеСвойствПодключения.Вставить("API","1cClientApp");
		
		// Используем дефолтные параметры, которые пришли в командной строке или из настроек
		Если СтруктураПодключения.ПользовательНеУказан=Истина Тогда
			ОписаниеСвойствПодключения.Вставить("Пароль1С",ПараметрыПодключенияПоУмолчанию.Пароль1С);
			ОписаниеСвойствПодключения.Вставить("Пользователь1С",ПараметрыПодключенияПоУмолчанию.Пользователь1С);
		КонецЕсли;

		// Используем дефолтные параметры базы, которые пришли в командной строке или из настроек
		Если СтруктураПодключения.БазаНеУказана=Истина Тогда
			ОписаниеСвойствПодключения.Вставить("СтрокаПодключения",ПараметрыПодключенияПоУмолчанию.СтрокаПодключения);
			ОписаниеСвойствПодключения.Вставить("ДополнительныеОпцииЗапуска",ПараметрыПодключенияПоУмолчанию.ДополнительныеОпцииЗапуска);
			ОписаниеСвойствПодключения.Вставить("ЭтоФайловаяБаза",ПараметрыПодключенияПоУмолчанию.ЭтоФайловаяБаза);		
		КонецЕсли;
		
		СтруктураДанных = новый  Структура(ИмяПараметра,ЗначениеВСтрокуВнутр(ОписаниеСвойствПодключения));		
		
	КонецЕсли;	
	
	Возврат СтруктураДанных;
	
КонецФункции

#КонецОбласти

#Область Вспомогательные

&НаСервереБезКонтекста
Функция мЗначениеИзСтрокиВнутр(Строка)
	Возврат ЗначениеИзСтрокиВнутр(Строка);
КонецФункции

&НаКлиенте
Процедура ЗагрузитьБиблиотеки()
	
	Если Модуль_СервисныеФункции=Неопределено Тогда
		Модуль_СервисныеФункции = ПолучитьФорму("ВнешняяОбработка.МенеджерСценарногоТеста.Форма.Модуль_СервисныеФункции");
	КонецЕсли;		
	
КонецПроцедуры

#КонецОбласти
